blueskycoco/rt-thread/bsp/tm4c129x/libraries/usblib/device/usbdbulk.c
#define NUM_BULK_SECTIONS       (sizeof(g_psBulkSections) /                   \
                                 sizeof(g_psBulkSections[0]))

//*****************************************************************************
//
// The header for the single configuration we support.  This is the root of
// the data structure that defines all the bits and pieces that are pulled
// together to generate the configuration descriptor.
//
//*****************************************************************************
const tConfigHeader g_sBulkConfigHeader =
{
    NUM_BULK_SECTIONS,
    g_psBulkSections
};

//*****************************************************************************
//
// Configuration Descriptor.
//
//*****************************************************************************
const tConfigHeader * const g_ppBulkConfigDescriptors[] =
{
    &g_sBulkConfigHeader
};

//*****************************************************************************
//
// Forward references for device handler callbacks
//
//*****************************************************************************
static void HandleConfigChange(void *pvBulkDevice, uint32_t ui32Info);
static void HandleDisconnect(void *pvBulkDevice);
static void HandleEndpoints(void *pvBulkDevice, uint32_t ui32Status);
static void HandleSuspend(void *pvBulkDevice);
static void HandleResume(void *pvBulkDevice);
static void HandleDevice(void *pvBulkDevice, uint32_t ui32Request,
                         void *pvRequestData);

//*****************************************************************************
//
// Device event handler callbacks.
//
//*****************************************************************************
const tCustomHandlers g_sBulkHandlers =
{
    //
    // GetDescriptor
    //
    0,

    //
    // RequestHandler
    //
    0,

    //
    // InterfaceChange
    //
    0,

    //
    // ConfigChange
    //
    HandleConfigChange,

    //
    // DataReceived
    //
    0,

    //
    // DataSentCallback
    //
    0,

    //
    // ResetHandler
    //
    0,

    //
    // SuspendHandler
    //
    HandleSuspend,

    //
    // ResumeHandler
    //
    HandleResume,

    //
    // DisconnectHandler
    //
    HandleDisconnect,

    //
    // EndpointHandler
    //
    HandleEndpoints,

    //
    // Device handler
    //
    HandleDevice
};

//*****************************************************************************
//
// Set or clear deferred operation flags in an "atomic" manner.
//
// \param pui16DeferredOp points to the flags variable which is to be modified.
// \param ui16Bit indicates which bit number is to be set or cleared.
// \param bSet indicates the state that the flag must be set to.  If \b true,
// the flag is set, if \b false, the flag is cleared.
//
// This function safely sets or clears a bit in a flag variable.  The operation
// makes use of bitbanding to ensure that the operation is atomic (no read-
// modify-write is required).
//
// \return None.
//
//*****************************************************************************
static void
SetDeferredOpFlag(volatile uint16_t *pui16DeferredOp, uint16_t ui16Bit,
                  bool bSet)
{
    //
    // Set the flag bit to 1 or 0 using a bitband access.
    //
    HWREGBITH(pui16DeferredOp, ui16Bit) = bSet ? 1 : 0;
}
static bool
ProcessDataFromHost(tUSBDBulkDevice *psBulkDevice, uint32_t ui32Status)
{
    uint32_t ui32EPStatus;
    uint32_t ui32Size;
    tBulkInstance *psInst;
	uint32_t ui32Count, ui32Pkt;
	int32_t i32Retcode;

    //
    // Get a pointer to the bulk device instance data pointer
    //
    psInst = &psBulkDevice->sPrivateData;

    //
    // Get the endpoint status to see why we were called.
    //
    ui32EPStatus = MAP_USBEndpointStatus(USB0_BASE, psInst->ui8OUTEndpoint);

    //
    // Clear the status bits.
    //
    MAP_USBDevEndpointStatusClear(USB0_BASE, psInst->ui8OUTEndpoint,
                                  ui32EPStatus);

    //
    // Has a packet been received?
    //
    if(ui32EPStatus & USB_DEV_RX_PKT_RDY)
    {
        //
        // Set the flag we use to indicate that a packet read is pending.  This
        // will be cleared if the packet is read.  If the client does not read
        // the packet in the context of the USB_EVENT_RX_AVAILABLE callback,
        // the event will be signaled later during tick processing.
        //
        SetDeferredOpFlag(&psInst->ui16DeferredOpFlags, BULK_DO_PACKET_RX,
                          true);

        //
        // How big is the packet we have just received?
        //
        ui32Size = MAP_USBEndpointDataAvail(psInst->ui32USBBase,
                                            psInst->ui8OUTEndpoint);
		//psInst->sBuffer.ui32Size=ui32Size;

        //
        // The receive channel is not blocked so let the caller know
        // that a packet is waiting.  The parameters are set to indicate
        // that the packet has not been read from the hardware FIFO yet.
        //
        /*psBulkDevice->pfnRxCallback(psBulkDevice->pvRxCBData,
                                    USB_EVENT_RX_AVAILABLE,
                                    ui32Size, (void *)0);*/
		i32Retcode = MAP_USBEndpointDataGet(psInst->ui32USBBase,
                                            psInst->ui8OUTEndpoint,
                                            psInst->sBuffer[psInst->sBuffer_id].pvData, &ui32Count);
		psInst->sBuffer[psInst->sBuffer_id].pfnRxCallback(psBulkDevice->pvRxCBData,psInst->sBuffer[psInst->sBuffer_id].pvData,ui32Count);
		MAP_USBDevEndpointDataAck(USB0_BASE, psInst->ui8OUTEndpoint, 0);
    }
    
    return(true);
}

//*****************************************************************************
//
// Called by the USB stack for any activity involving one of our endpoints
// other than EP0.  This function is a fan out that merely directs the call to
// the correct handler depending upon the endpoint and transaction direction
// signaled in ui32Status.
//
//*****************************************************************************
static void
HandleEndpoints(void *pvBulkDevice, uint32_t ui32Status)
{
    tUSBDBulkDevice *psBulkDevice;
    tBulkInstance *psInst;
    uint32_t ui32EPStatus;
    uint32_t ui32Size;
	static int len=0,len1=0;
	register rt_base_t temp;
	struct sBuffer **sbuf;
    ASSERT(pvBulkDevice != 0);

    //
    // The bulk device structure pointer.
    //
    psBulkDevice = (tUSBDBulkDevice *)pvBulkDevice;

    //
    // Get a pointer to the bulk device instance data pointer
    //
    psInst = &psBulkDevice->sPrivateData;
    //
    // Read out the current endpoint status.
    //
	
	//rt_kprintf("cur %d epstatus %x ui32Status %x ,dma status %d\n",*(int *)psBulkDevice->pvRxCBData, ui32EPStatus,ui32Status,USBLibDMAChannelStatus(psInst->psDMAInstance,psInst->ui8OUTDMA));
	
	//
    // Handler for the bulk OUT data endpoint.
    //
    if(*(int *)(psBulkDevice->pvRxCBData)==0)
    {
    	/*usbbulk 0 just for param config*/
		if(ui32Status & (0x10000 << USBEPToIndex(psInst->ui8OUTEndpoint)))
   		{
			ProcessDataFromHost(pvBulkDevice,ui32Status);
		}

		if(ui32Status & (1 << USBEPToIndex(psInst->ui8INEndpoint)))
		{
			rt_sem_release(&(psInst->tx_sem));
		}
    }
	else
	{
		
   	 	ui32EPStatus = MAP_USBEndpointStatus(USB0_BASE, psInst->ui8OUTEndpoint);
	    if(ui32Status & (0x10000 << USBEPToIndex(psInst->ui8OUTEndpoint)))
		{
			if((USBLibDMAChannelStatus(psInst->psDMAInstance,psInst->ui8OUTDMA) ==	USBLIBSTATUS_DMA_COMPLETE)&&psInst->ui32Flags == USBD_FLAG_DMA_IN)
			{
		    //	rt_kprintf("rcv data over\n");
			 //USBEndpointDMADisable(USB0_BASE,
			//					  psInst->ui8OUTEndpoint, USB_EP_DEV_OUT);	
			//MAP_USBDevEndpointDataAck(USB0_BASE, psInst->ui8OUTEndpoint, 0);	
			#if 1
			//if(len1!=64)
			//	USBLibDMAChannelDisable(psInst->psDMAInstance,psInst->ui8OUTDMA);
			
			#if 1
			if(len==USB_BUF_LEN)
			{
				//psInst->sBuffer.pfnRxCallback(psBulkDevice->pvRxCBData,&(psInst->sBuffer.pvData),psInst->sBuffer.ui32Size);
				//psBulkDevice->pfnRxCallback(psBulkDevice->pvRxCBData,
                 //                   USB_EVENT_RX_AVAILABLE, len,
                   //                 (void *)0);
				len=0;
				len1=0;
				psInst->sBuffer[psInst->sBuffer_id].ui32LastSize=0;
				sbuf=&(psInst->sBuffer[psInst->sBuffer_id]);
				//rt_kprintf("out1 buf %x %d\n",psInst->sBuffer[psInst->sBuffer_id].pvData,psInst->sBuffer_id);
                rt_mb_send(psInst->rx_pbuf_mb, (rt_uint32_t)(sbuf));
				if(psInst->sBuffer_id==(USB_SBUF_CNT-1))
				{
					psInst->sBuffer_id=0;
				}				
				psInst->sBuffer_id++;
				psInst->sBuffer[psInst->sBuffer_id].pvData=rt_malloc(USB_BUF_LEN);
				psInst->sBuffer[psInst->sBuffer_id].ui32Size=USB_BUF_LEN;
				psInst->sBuffer[psInst->sBuffer_id].ui32LastSize=0;
				//rt_kprintf("next1 buf %x %d\n",psInst->sBuffer[psInst->sBuffer_id].pvData,psInst->sBuffer_id);
			}
			#endif
				//MAP_USBDevEndpointDataAck(USB0_BASE, psInst->ui8OUTEndpoint, 0);	
			//
			// Acknowledge that the data was read, this will not cause a bus
			// acknowledgment.
			//
			//
			// Inform the callback of the new data.
			//
			//rt_kprintf("recv data %d\n",len1);
			psInst->ui32Flags=0;
			#else
			USBLibDMAChannelDisable(psInst->psDMAInstance,psInst->ui8OUTDMA);
			//rt_kprintf("data rcv done\n");
			rt_sem_release(&(psInst->rx_sem_done));
			MAP_USBDevEndpointDataAck(USB0_BASE, psInst->ui8OUTEndpoint, 0);	
			psInst->ui32Flags=0;
			#endif
			}
			ui32Size = USBEndpointDataAvail(psInst->ui32USBBase,psInst->ui8OUTEndpoint);
			//rt_kprintf("last ui32Size %d\n",ui32Size);
			if(ui32EPStatus & USB_DEV_RX_PKT_RDY)
			{
				//psInst->sBuffer.ui32Size=ui32Size;
				//
				// Configure the next DMA transfer.
				//
				//psBulkDevice->pfnRxCallback(psBulkDevice->pvRxCBData,
                //                    USB_EVENT_RX_AVAILABLE, ui32Size,
                //                   (void *)0);
				//rt_kprintf("data in %d\n",ui32Size);
				#if 1
				if(ui32Size!=64)
				{
					//rt_uint8_t pi8Data[64];
					int ui32Count=psInst->sBuffer[psInst->sBuffer_id].ui32Size;
					int result;
					result=MAP_USBEndpointDataGet(psInst->ui32USBBase,
                                            psInst->ui8OUTEndpoint,
                                            (uint8_t *)((int32_t)(psInst->sBuffer[psInst->sBuffer_id].pvData)+len), &ui32Count);
					MAP_USBDevEndpointDataAck(USB0_BASE, psInst->ui8OUTEndpoint, 0);
					rt_kprintf("last size %d len %d,real get %d,result %d \n",ui32Size,len,ui32Count,result);
					psInst->sBuffer[psInst->sBuffer_id].ui32LastSize=len+ui32Size;
					sbuf=&(psInst->sBuffer[psInst->sBuffer_id]);
					//rt_kprintf("out last buf %x %d\n",psInst->sBuffer[psInst->sBuffer_id].pvData,psInst->sBuffer_id);
					rt_mb_send(psInst->rx_pbuf_mb, (rt_uint32_t)(sbuf));
					//psInst->sBuffer[psInst->sBuffer_id].ui32Size=ui32Count;
					if(psInst->sBuffer_id==(USB_SBUF_CNT-1))
						psInst->sBuffer_id=0;
					psInst->sBuffer_id++;
					psInst->sBuffer[psInst->sBuffer_id].pvData=rt_malloc(USB_BUF_LEN);					
					psInst->sBuffer[psInst->sBuffer_id].ui32Size=USB_BUF_LEN;
					psInst->sBuffer[psInst->sBuffer_id].ui32LastSize=0;
					//rt_kprintf("next last buf %x %d\n",psInst->sBuffer[psInst->sBuffer_id].pvData,psInst->sBuffer_id);
					len=0;//len+ui32Size;
					//rt_kprintf("got %d\n",len);
					wait_flag=1;
					len=0;
				}
				else
				{
					USBLibDMATransfer(psInst->psDMAInstance, psInst->ui8OUTDMA,(void *)((int32_t)(psInst->sBuffer[psInst->sBuffer_id].pvData+len)), ui32Size);
					USBLibDMAChannelEnable(psInst->psDMAInstance,psInst->ui8OUTDMA);
					//rt_kprintf("fill buf %x %d\n",psInst->sBuffer[psInst->sBuffer_id].pvData,psInst->sBuffer_id);
					len+=ui32Size;
					len1=ui32Size;
					psInst->ui32Flags=USBD_FLAG_DMA_IN;
				}
				//rt_kprintf("get data %d outdma %d , endpoint %d\n",ui32Size,psInst->ui8OUTDMA,psInst->ui8OUTEndpoint);
				#else
				//rt_kprintf("data in %d\n",ui32Size);
				temp = rt_hw_interrupt_disable();
				wait_flag=1;
				rt_hw_interrupt_enable(temp);
				rt_sem_release(&(psInst->rx_sem_begin));
				#endif
			}
		}		
		else if((USBLibDMAChannelStatus(psInst->psDMAInstance,psInst->ui8OUTDMA) ==	USBLIBSTATUS_DMA_COMPLETE)&&psInst->ui32Flags == USBD_FLAG_DMA_IN)
			{
		    //	rt_kprintf("rcv data over\n");
			// USBEndpointDMADisable(USB0_BASE,
			//					  psInst->ui8OUTEndpoint, USB_EP_DEV_OUT);	
			//MAP_USBDevEndpointDataAck(USB0_BASE, psInst->ui8OUTEndpoint, 0);	
			#if 1
			//if(len1!=64)
			//	USBLibDMAChannelDisable(psInst->psDMAInstance,psInst->ui8OUTDMA);
			
			#if 1
			if(len==USB_BUF_LEN)
			{
				//psInst->sBuffer.pfnRxCallback(psBulkDevice->pvRxCBData,&(psInst->sBuffer.pvData),psInst->sBuffer.ui32Size);
				//psBulkDevice->pfnRxCallback(psBulkDevice->pvRxCBData,
                 //                   USB_EVENT_RX_AVAILABLE, len,
                   //                 (void *)0);
				len=0;
				len1=0;
				psInst->sBuffer[psInst->sBuffer_id].ui32LastSize=0;
				sbuf=&(psInst->sBuffer[psInst->sBuffer_id]);
				//rt_kprintf("out2 buf %x %d\n",psInst->sBuffer[psInst->sBuffer_id].pvData,psInst->sBuffer_id);
                rt_mb_send(psInst->rx_pbuf_mb, (rt_uint32_t)(sbuf));
				if(psInst->sBuffer_id==(USB_SBUF_CNT-1))
				{
					psInst->sBuffer_id=0;
				}				
				psInst->sBuffer_id++;
				psInst->sBuffer[psInst->sBuffer_id].pvData=rt_malloc(USB_BUF_LEN);
				psInst->sBuffer[psInst->sBuffer_id].ui32Size=USB_BUF_LEN;
				psInst->sBuffer[psInst->sBuffer_id].ui32LastSize=0;
				//rt_kprintf("next2 buf %x %d\n",psInst->sBuffer[psInst->sBuffer_id].pvData,psInst->sBuffer_id);
			}
			#endif
				//MAP_USBDevEndpointDataAck(USB0_BASE, psInst->ui8OUTEndpoint, 0);	
			//
			// Acknowledge that the data was read, this will not cause a bus
			// acknowledgment.
			//
			//
			// Inform the callback of the new data.
			//
			//rt_kprintf("recv data %d\n",len1);
			psInst->ui32Flags=0;
			#else
			USBLibDMAChannelDisable(psInst->psDMAInstance,psInst->ui8OUTDMA);
			//rt_kprintf("data rcv done\n");
			rt_sem_release(&(psInst->rx_sem_done));
			MAP_USBDevEndpointDataAck(USB0_BASE, psInst->ui8OUTEndpoint, 0);	
			psInst->ui32Flags=0;
			#endif
			}
	    else if((USBLibDMAChannelStatus(psInst->psDMAInstance,psInst->ui8INDMA) ==	USBLIBSTATUS_DMA_COMPLETE)&&psInst->ui32Flags == USBD_FLAG_DMA_OUT)
	    {
		 	//
	    	// Handler for the bulk IN data endpoint.
	    	//
			USBLibDMAChannelDisable(psInst->psDMAInstance,psInst->ui8INDMA);
			rt_sem_release(&(psInst->tx_sem));
			psInst->ui32Flags=0;
	    }		
		MAP_USBDevEndpointStatusClear(USB0_BASE, psInst->ui8OUTEndpoint,ui32EPStatus);
	}
}

//*****************************************************************************
//
// Called by the USB stack whenever a configuration change occurs.
//
//*****************************************************************************
static void
HandleConfigChange(void *pvBulkDevice, uint32_t ui32Info)
{
    tBulkInstance *psInst;
    tUSBDBulkDevice *psBulkDevice;

